Revit 2027 API
BuiltInFailures.StairRampFailures.MultistoryStairsAutomaticLevelLandingsDeleted Property
 Level landings are deleted because the connected stairs have been regenerated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultistoryStairsAutomaticLevelLandingsDeleted { get; }
Public Shared ReadOnly Property MultistoryStairsAutomaticLevelLandingsDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultistoryStairsAutomaticLevelLandingsDeleted {
	FailureDefinitionId^ get ();
}
static member MultistoryStairsAutomaticLevelLandingsDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace